app/controllers/applicants_controller.rb

  def show

    # security check
    @job = Job.find(params[:id], :conditions => ["employer_id = ?", current_user.employer.id])
    (@job.employer_id == current_user.employer.id).to_console
    if @job.employer_id == current_user.employer.id
      @applicants = Applicant.paginate(:conditions => ["job_id = ?", @job.id], :per_page => 10, :page => params[:page])
---
SELECT * FROM `employers` WHERE (`employers`.user_id = 4) LIMIT 1
SELECT * FROM `applicants` WHERE (job_id = 10) LIMIT 0, 10

  def applicant_message
    @title = "Applicant Message"
    @applicant = Applicant.find(params[:id])
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 6)

  def destroy
    @applicant = Applicant.find(params[:id])

    # security
    job = Job.find(@applicant.job_id, :select => "id, employer_id")
    if current_user.employer.id == job.employer_id
      flash[:notice] = "The applicant has been deleted"
      @applicant.destroy
---
SELECT * FROM `applicants` WHERE (`applicants`.`id` = 4)
DELETE FROM `applicants` WHERE `id` = 4