app/controllers/employers_controller.rb

SELECT * FROM `employers` WHERE (`employers`.`user_id` = 7) LIMIT 1
SELECT * FROM `logos` WHERE (`logos`.`employer_id` = 1) LIMIT 1
---
  def index
    @title = "Welcome Employer"
    @employer = Employer.find_by_user_id(current_user.id)
    @logo = Logo.find_by_employer_id(@employer.id)

SELECT * FROM `employers` WHERE (`employers`.`id` = '1') LIMIT 1
---
  def public
    @employer = Employer.find_by_id(params[:id])

SELECT * FROM `employers` WHERE (`employers`.user_id = 7) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 7) LIMIT 1
---
  def edit
    @employer = Employer.find(current_user.employer.id)
    @user = User.find(current_user.id)

SELECT * FROM `users` WHERE (`users`.`id` = 7) LIMIT 1
---
  def update
    @user = User.find(params[:id])