app/controllers/jobs_controller.rb

  def index

    category = "Dental"

    # main job finder query

    if params[:commit] == "Search"
      @jobs = Job.find_jobs(params[:job_title], params[:profession], params[:location]).paginate :per_page => 20, :page => params[:page], :order => 'jobs.created_at DESC'
    else
      @jobs = Job.paginate :per_page => 20, :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `professions`

  def employer_index
    @title = "Your Job Listings"
    @jobs = Job.paginate :conditions => ["employer_id = ?", current_user.employer.id], :per_page => 20, :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `employers` WHERE (`employers`.user_id = 7) LIMIT 1

  def show
    @job = Job.find(params[:id])

    # Grab users resumes if they are a job seeker that is logged in
    # so they can be used in the modal dialog partial
    if logged_in? && current_user.account_type == "seeker"
      @resumes = Resume.find_all_by_seeker_id(current_user.seeker.id)
---
SELECT * FROM `resumes` WHERE (`resumes`.`seeker_id` = 4)

  def create
    @job = Job.new(params[:job])
    @job.employer_id = current_user.employer.id

    @job.address.city = "Other" if @job.address.state == "Please Select"

    respond_to do |format|
      if @job.save
---
INSERT INTO `addresses` (`city`, `created_at`, `country`, `zipcode`, `updated_at`, `addressable_type`, `addressable_id`, `phone2`, `phone`, `state`) VALUES('129', '2010-06-23 23:02:21', 'Canada', 'L9M1J3', '2010-06-23 23:02:21', 'Job', 11, NULL, NULL, 'Ontario')