app/controllers/logos_controller.rb

SELECT * FROM `logos` WHERE (`logos`.`employer_id` = 4) LIMIT 1
---
  def new
    @logo = Logo.find_by_employer_id(@employer.id)

INSERT INTO `logos` (`logo_updated_at`, `created_at`, `updated_at`, `logo_file_name`, `employer_id`, `logo_content_type`, `logo_file_size`, `datetime`, `integer`) VALUES('2010-06-28 16:58:39', '2010-06-28 16:58:41', '2010-06-28 16:58:41', 'igoogle_logo_sm.gif', 1, 'image/gif', 4857, NULL, NULL)
---
  def create
    @logo = Logo.new(params[:logo])
    @logo.employer_id = current_user.employer.id

    respond_to do |format|
      if @logo.save

SELECT * FROM `logos` WHERE (`logos`.`employer_id` = 4) LIMIT 1
UPDATE `logos` SET `updated_at` = '2010-06-28 17:42:11', `logo_updated_at` = '2010-06-28 17:42:10', `logo_content_type` = 'image/jpeg', `logo_file_size` = 2536, `logo_file_name` = 'youtube.jpg' WHERE `id` = 1
---
  def update
    @logo = Logo.find_by_employer_id(@employer.id)
    unless @logo.nil?
      @logo.update_attributes(params[:logo])

SELECT * FROM `employers` WHERE (`employers`.`user_id` = 7) LIMIT 1
---
  def set_employer_account
    @employer = Employer.find_by_user_id(current_user.id)