app/controllers/resumes_controller.rb

SELECT * FROM `resumes` WHERE (`resumes`.`seeker_id` = 4)
---
  def index
    @resumes = Resume.find_all_by_seeker_id(current_user.seeker.id)

INSERT INTO `resumes` (`name`, `resume_updated_at`, `seeker_id`, `created_at`, `updated_at`, `primary`, `resume_file_name`, `resume_content_type`, `resume_file_size`, `datetime`, `integer`) VALUES('Resume 1', '2010-06-25 06:35:48', 4, '2010-06-25 06:35:48', '2010-06-25 06:35:48', NULL, 'resume.rtf', 'text/rtf', 337, NULL, NULL)
---
  def create
    @resume = Resume.new(params[:resume])
    @resume.seeker_id = current_user.seeker.id

    respond_to do |format|
      if @resume.save

SELECT * FROM `resumes` WHERE (`resumes`.`id` = '2') LIMIT 1
DELETE FROM `resumes` WHERE `id` = 2
---
  def destroy
    @resume = Resume.find_by_id(params[:id])

    # make sure user owns this resume
    unless @resume.nil?
      unless @resume.seeker_id == current_user.seeker.id
        flash[:error] = "You do not own this resume."
        redirect_to resumes_path
        return
      end
    end

    @resume.destroy