app/controllers/seekers_controller.rb

  def index
    @title = "Welcome Job Seeker"
    @seeker = Seeker.find_by_user_id(current_user.id)
---
SELECT * FROM `seekers` WHERE (`seekers`.`user_id` = 8) LIMIT 1

  def public
    @seeker = Seeker.find_by_id(params[:id])
---
SELECT * FROM `seekers` WHERE (`seekers`.`id` = '4') LIMIT 1

  def edit
    @seeker = Seeker.find(current_user.seeker.id)
    @user = User.find(current_user.id)
---
SELECT * FROM `seekers` WHERE (`seekers`.user_id = 9) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 9) LIMIT 1

  def update
    @user = User.find(params[:id])

    unless @user.nil?
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 9) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-06-25 06:30:55', `name` = 'johnn marrocco2', `last_name` = 'marrocco2', `first_name` = 'johnn' WHERE `id` = 9

  def apply_for_job
    @title = "Apply for Job"
    @job = Job.find_by_id(params[:job_id])
    @resumes = Resume.find_all_by_seeker_id(current_user.seeker.id)
---
SELECT * FROM `resumes` WHERE (`resumes`.`seeker_id` = 4)

  def applied
    if request.post?
      @title = "Your application has been sent"
      @job_id = params[:job_id]
      @resume_id = params[:attachment][:resume]
      @coverletter_id = params[:attachment][:coverletter]
      @message_for_employer = params[:message_for_employer]

      applicant = Applicant.new
      applicant.seeker_id = current_user.seeker.id
      applicant.job_id = @job_id
      applicant.save

      if applicant.save
        flash[:notice] = "Your application has been sent."
        # Notify employer by mail that a new application has been sent

        # Attach user message if available
        if @message_for_employer
          applicant.message_for_employer = @message_for_employer
        end

        # Documents
        if @resume_id && @resume_id.to_i > 0
          applicant.resumes << Resume.find(@resume_id)
          applicant.save
---
INSERT INTO `applicants` (`seeker_id`, `created_at`, `resume_id`, `updated_at`, `job_id`, `coverletter_id`) VALUES(4, '2010-06-25 18:42:42', 1, '2010-06-25 18:42:42', 1, 4)
SELECT * FROM `employers` WHERE (`employers`.`id` = 2)
SELECT * FROM `resumes` WHERE (`resumes`.`id` = 1)
SELECT * FROM `seekers` WHERE (`seekers`.user_id = 9) LIMIT 1
UPDATE `applicants` SET `updated_at` = '2010-06-28 16:24:10', `message_for_employer` = 'weeeeeeeeeeee' WHERE `id` = 2